Управление_торговлей.ПБТ/src/Documents/вт_ПередачаСырьяВПереработку/вт_ПередачаСырьяВПереработку.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>вт_ПередачаСырьяВПереработку</name>
  <registerRecords>AccumulationRegister.вт_ДавальческоеСырьеПереданное</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыНаСкладах</registerRecords>
  <registerRecords>AccumulationRegister.ПартииТоваровОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыКОтгрузке</registerRecords>
  <registerRecords>AccumulationRegister.ТоварыОрганизаций</registerRecords>
  <registerRecords>AccumulationRegister.СвободныеОстатки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусУказанияСерий</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаПартий</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаПартий</types>
      </type>
    </attributes>
    <attributes>
      <name>КлючСвязиСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АналитикаУчетаНоменклатуры</name>
      <type>
        <types>CatalogRef.КлючиАналитикиУчетаНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Серии</name>
    <attributes>
      <name>Серия</name>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <type>
        <types>CatalogRef.Назначения</types>
      </type>
    </attributes>
    <attributes>
      <name>Склад</name>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/AccumulationRegisters/вт_ДавальческоеСырьеПереданное/вт_ДавальческоеСырьеПереданное.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>вт_ДавальческоеСырьеПереданное</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Партнеры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="80440cbb-f97b-4620-8eca-b89f9a033f08">
  <name>ТоварыНаСкладах</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <registerType>Checked</registerType>
  </extension>
  <resources extendedConfigurationObject="2d1fe73e-1f3d-4ee9-9dd1-010dfff742b1">
    <name>ВНаличии</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <resources extendedConfigurationObject="d7a580fb-b3d4-4540-9057-2bf42dbcce49">
    <name>КОтгрузке</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="70b08d50-30e9-4115-9e39-67ef989c58b2">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="29d5a4e7-4544-4ed2-a8bf-d541eef13703">
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="32c528cc-88fa-48ca-967d-eb0035bcc3a8">
    <name>Серия</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:AccumulationRegister>

Управление_торговлей.ПБТ/src/Documents/вт_ПередачаСырьяВПереработку/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр вт_ДавальческоеСырьеПереданное Приход
	Движения.вт_ДавальческоеСырьеПереданное.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.вт_ДавальческоеСырьеПереданное.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Партнер = Партнер;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Характеристика = ТекСтрокаТовары.Характеристика;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

	//////регистр свободные остатки
	Движения.СвободныеОстатки.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.СвободныеОстатки.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Характеристика = ТекСтрокаТовары.Характеристика;
		Движение.Склад = Склад;
		Движение.ВРезервеСоСклада = ТекСтрокаТовары.Количество;
	КонецЦикла;

	//////регистр свободные остатки
	//Движения.ТоварыКОтгрузке.Записывать = Истина;
	//Для Каждого ТекСтрокаТовары Из Товары Цикл
	//	Движение = Движения.ТоварыКОтгрузке.Добавить();
	//	Движение.Регистратор = Ссылка;
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Склад = Склад;
	//	Движение.Получатель = ЭтотОбъект.Партнер;
	//	
	//	Движение.ДокументОтгрузки = Ссылка;
	//	Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
	//	Движение.Характеристика = ТекСтрокаТовары.Характеристика;

	//	Движение.ВРезерве = ТекСтрокаТовары.Количество;
	//КонецЦикла;
	
	// регистр ТоварыНаСкладах Расход
	Движения.ТоварыНаСкладах.Записывать = Истина;
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ТоварыНаСкладах.Добавить();
		Движение.Регистратор 	= Ссылка;
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.Номенклатура 	= ТекСтрокаТовары.Номенклатура;
		Движение.Характеристика = ТекСтрокаТовары.Характеристика;
		Движение.Склад 			= Склад;
		Движение.ВНаличии 		= ТекСтрокаТовары.Количество;
		Движение.Серия 			= ТекСтрокаТовары.Серия;
	КонецЦикла;

//	ДвиженияПоРеглРегистрам();
	


КонецПроцедуры

Функция ПолучитьПервуюСтатьюРасходов()
	Выборка=ПланыВидовХарактеристик.СтатьиРасходов.Выбрать();
	Если Выборка.Следующий() ТОгда
		Возврат Выборка.Ссылка;
	КонецЕсли;
	
	Возврат ПланыВидовХарактеристик.СтатьиДоходов.ПустаяСсылка();
	
КонецФункции

Процедура ДвиженияПоРеглРегистрам()
	//Возьмем движения по регистрам, аналогичные оприходование товаров
    //Возвращаем сырье обратно на склад
	
	ДокСписание = Документы.СписаниеНедостачТоваров.СоздатьДокумент();
	ДокСписание.Дата = Дата;
	ДокСписание.Склад = Склад;
	ДокСписание.Организация =  Организация;
	ДокСписание.СтатьяРасходов = ПолучитьПервуюСтатьюРасходов();
	
	
	ТаблТовары = ЭтотОбъект.Товары.Выгрузить();
	ТаблТовары.Свернуть("Номенклатура,Характеристика","Количество");
	
	ДокСписание.Товары.Загрузить(ТаблТовары);
	
	ДокСписание.Записать(РежимЗаписиДокумента.Проведение);
	
	ДвижДокСборка = ДокСписание.Движения;
	
	МД_ДокСборка = ДокСписание.метаданные().Движения;
	МД_ЭтотОбъект = ЭтотОбъект.метаданные().Движения;
	МД_Массив = Новый Массив;
	Для каждого МД_СтрЭтотОбъект из МД_ЭтотОбъект цикл
		Для каждого МД_СтрДокСборка из МД_ДокСборка цикл
			Если МД_СтрДокСборка.Имя = МД_СтрЭтотОбъект.Имя тогда
				МД_Массив.Добавить(МД_СтрЭтотОбъект.Имя);
			КонецЕсли;
		КонецЦикла;	
	КонецЦикла;
	ДвижСебестоимость = новый ТаблицаЗначений;
	Для каждого ЭлементМД_Массив из МД_Массив цикл
		
		ДвижСебестоимость = ДвижДокСборка[ЭлементМД_Массив].выгрузить();
		ДвижСебестоимость.Колонки.Удалить("Регистратор");
		
			Движения[ЭлементМД_Массив].Записывать = Истина;
			Движения[ЭлементМД_Массив].Загрузить(ДвижСебестоимость);
			
			//Для каждого СтрокаДвижСебестоимость Из ДвижСебестоимость Цикл
			//	НоваяСтрокаДвижСебестоимость = Движения[ЭлементМД_Массив].Добавить();
			//	ЗаполнитьЗначенияСвойств(НоваяСтрокаДвижСебестоимость, СтрокаДвижСебестоимость);
			//КонецЦикла;
		
	КонецЦикла;
	
	Попытка  
		ДокСписание.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Исключение
	КонецПопытки;	
	ДокСписание.УстановитьПометкуУдаления(Истина);
	
	УдалитьДанныеДокументов(ДокСписание.Ссылка);
	
	ДокСписание.ОбменДанными.Загрузка=истина;
	ДокСписание.Удалить();	
	
КонецПроцедуры	


Процедура УдалитьДанныеДокументов(ДокСсылка)
	НЗ = РегистрыСведений.РеестрДокументов.СоздатьНаборЗаписей();
	НЗ.Отбор.Ссылка.Установить(ДокСсылка);
	НЗ.Прочитать();
	НЗ.Очистить();
	НЗ.Записать(Истина);	
КонецПроцедуры
